var dataSet = [
  [
    "1",
    "1PART4",
    "ของที่ส่งออกรวมทั้งของที่ส่งกลับออกไปซึ่งนำกลับเข้ามาภายในหนึ่งปีโดยไม่เปลี่ยนแปลงลักษณะหรือรูปแต่ประการใดและในเวลาที่ส่งออกนั้นได้รับใบสุทธิสำหรับนำกลับเข้ามาแล้วหมายเหตุอธิบดีกรมศุลกากรมีอำนาจที่จะสั่งให้ได้รับการยกเว้นจากบทบัญญัติที่ว่าด้วยใบสุทธิสำหรับเข้ามาแล้ว",
  ],
  [
    "2",
    "2PART4",
    "ก. ของที่ได้รับยกเว้นอากรตามประเภทนี้ให้ได้รับยกเว้นเพียงเท่าราคาหรือปริมาณแห่งของเดิมที่ส่งออกไปเท่านั้นสำหรับราคาหรือปริมาณที่เพิ่มขึ้นเนื่องจากการซ่อมให้เสียอากรตามพิกัดอัตราอากรของของเดิมที่ส่งออกไปซ่อมโดยคำนวณจากราคาหรือปริมาณที่เพิ่มขึ้นทั้งนี้ไม่รวมค่าใช้จ่ายในการขนส่ง และการประกันภัย",
  ],
  [
    "3",
    "2PART4",
    "ข. อธิบดีกรมศุลกากรมีอำนาจที่จะสั่งให้ได้รับการยกเว้นจากบทบัญญัติที่ว่ด้วยใบสุทธิสำหรับนำกลับเข้ามาหรืออาจอนุญาตให้ขยายกำหนดเวลาออกไปอีกตามความจำเป็นแก่กรณีได้",
  ],
  [
    "4",
    "3PART4",
    "(ก) ของที่ใช้ในการแสดงละครหรือการแสดงอย่างอื่นที่คล้ายกันซึ่งผู้แสดงที่ท่องเที่ยวนำเข้ามา",
  ],
  [
    "5",
    "3PART4",
    "(ข) เครื่องประกอบและของใช้ในการทดลองหรือการแสดงเพื่อวิทยาศาสตร์หรือการศึกษาซึ่งบุคคลที่เข้ามาในราชอาณาจักรเป็นการชั่วคราวนำเข้ามาเพื่อจัดการทดลองหรือแสดง",
  ],
  [
    "6",
    "3PART4",
    "(ค) รถสำหรับเดินบนถนนเรือและอากาศยานบรรดาที่เจ้าของนำเข้ามาพร้อมกับตน",
  ],
  [
    "7",
    "3PART4",
    "(ง) เครื่องถ่ายรูปและเครื่องบันทึกเสียงซึ่งบุคคลที่เข้ามาในราชอาณาจักรเป็นการชั่วคราวนำเข้ามาเพื่อใช้ถ่ายรูปหรือบันทึกเสียงต่างๆแต่ฟิล์มและแผ่นสำหรับถ่ายรูปหรือสิ่งที่ใช้บันทึกเสียงซึ่งนำมาใช้ในการนี้ต้องเป็นไปตามเงื่อนไขและปริมาณที่รัฐมนตรีว่าการกระทรวงการคลังกำหนด",
  ],
  [
    "8",
    "3PART4",
    "(จ) อาวุธปืนและกระสุนปืนซึ่งบุคคลที่เข้ามาในราชอาณาจักรเป็นการชั่วคราวนำเข้ามาพร้อมกับตน",
  ],
  [
    "9",
    "3PART4",
    "(ฉ) ของที่นำเข้ามาเป็นการชั่วคราวโดยมุ่งหมายจะแสดงในงานสาธารณะที่เปิดให้ประชาชนดูได้ทั่วไป",
  ],
  [
    "10",
    "3PART4",
    "(ช) ของที่นำเข้ามาเพื่อซ่อมแต่ต้องปฏิบัติภายในเงื่อนไขที่อธิบดีกรมศุลกากรกำหนด",
  ],
  [
    "11",
    "3PART4",
    "(ซ) ตัวอย่างสินค้านอกจากที่ระบุไว้ในประเภทที่14ซึ่งบุคคลที่เข้ามาในราชอาณาจักรเป็นการชั่วคราวนำเข้ามาพร้อมตนและมีสภาพซึ่งเมื่อจะส่งกลับออกไปสามารถตรวจได้แน่นอนว่าเป็นของอันเดียวกับที่นำเข้ามาแต่ต้องมีปริมาณหรือค่าซึ่งเมื่อรวมกันเข้าแล้วไม่เกินกว่าที่จะเห็น",
  ],
  [
    "12",
    "3PART4",
    "(ญ) เครื่องมือและสิ่งประกอบ สำหรับงานก่อสร้าง  ให้ได้รับยกเว้นเพียงเท่าเงินอากรที่จะพึงต้อง เสียในขณะนำเข้าหักด้วยจำนวนเงินอากรที่คำนวณตามระยะเวลาที่ของนั้นอยู่ในประเทศ ในอัตราร้อยละหนึ่งต่อเดือนของจำนวนเงินอากรที่จะพึงต้องเสียในขณะนำเข้า ในการคำนวณให้นับเศษของเดือนเป็นหนึ่งเดือน และจะต้องชำระอากรก่อนส่งกลับออกไป กับทั้งจะต้องปฏิบัติตามระเบียบที่อธิบดีกรมศุลกากรกำหนดด้วย",
  ],
  [
    "13",
    "4PART4",
    "รางวัลและเหรียญตราที่ทางต่างประเทศมอบให้แก่บุคคลที่อยู่ในราชอาณาจักรเพื่อเป็นเกียรติในความดีเด่นทางศิลปะวรรณกรรมวิทยาศาสตร์การกีฬาหรือบริการสาธารณะหรือเพื่อเป็นเกียรติประวัติในความสำเร็จหรือพฤติกรรมอันเป็นสาธารณประโยชน์แต่เฉพาะรางวัลนั้นจะต้องอยู่ในดุลพินิจของอธิบดีกรมศุลกากร ที่จะพึงพิจารณาตามแต่จะเห็นสมควรอีกส่วนหนึ่งด้วย",
  ],
  [
    "14",
    "5PART4",
    "(ก)บุหรี่สองร้อยมวนหรือซิการ์หรือยาเส้นอย่างละสองร้อยห้าสิบกรัมหรือหลายชนิดรวมกันมีน้ำหนักทั้งหมดสองร้อยห้าสิบกรัมแต่ทั้งนี้บุหรี่ต้องไม่เกินสองร้อยมวน",
  ],
  ["15", "5PART4", "(ข)สุราหนึ่งลิตร"],
  [
    "16",
    "6PART4",
    "ของใช้ในบ้านเรือนที่ใช้แล้วที่เจ้าของนำเข้ามาพร้อมกับตนเนื่องในการย้ายภูมิลำเนา และมีจำนวนพอสมควรแก่ฐานะหมายเหตุของส่วนตัวและของใช้ในบ้านเรือนตามประเภทที่ 5 และ 6 นั้นจะต้องนำเข้ามาถึงประเทศไทยไม่เกินหนึ่งเดือนก่อนที่ผู้นำของเข้าเข้ามาถึงหรือไม่เกินหกเดือนนับแต่วันที่ผู้นำของเข้าเข้ามาถึง อธิบดีกรมศุลกากรมีอำนาจขยายกำหนดเวลาที่กล่าวข้างต้นได้เมื่อเห็นว่ามีพฤติการณ์พิเศษ",
  ],
  [
    "17",
    "7PART4",
    "ส่วนประกอบและอุปกรณ์ประกอบของอากาศยานหรือเรือรวมทั้งวัสดุที่นำเข้ามาเพื่อใช้ซ่อมหรือสร้างอากาศยานหรือเรือหรือส่วนของอากาศยานหรือเรือดังกล่าวหมายเหตุการยกเว้นอากรรวมทั้งของที่ได้รับยกเว้นอากรตามประเภทนี้ต้องเป็นไปตามหลักเกณฑ์และเงื่อนไขที่อธิบดีกรมศุลกากรกำหนด ด้วยความเห็นชอบของรัฐมนตรีว่าการกระทรวงการคลัง",
  ],
  [
    "18",
    "8PART4",
    "น้ำมันเชื้อเพลิงน้ำมันหยอดเครื่องและสิ่งที่ใช้ในการหล่อลื่นที่เติมในอากาศยานหรือในเรือที่มีขนาดเกินกว่าห้าร้อยตันกรอสส์ซึ่งศุลกากรได้ปล่อยให้ไปต่างประเทศแล้วหมายเหตุอธิบดีกรมศุลกากรมีอำนาจในอันที่จะทำให้บทยกเว้นนี้บังเกิดผลโดยวิธีคืนเงินอากรที่ได้ชำระแล้ว",
  ],
  [
    "19",
    "9PART4",
    "พืชผลที่ผู้มีภูมิลำเนาอยู่ในประเทศไทยปลูกในเกาะดอนและที่ชายตลิ่งแม่น้ำซึ่งกั้นเขตแดนประเทศไทย",
  ],
  [
    "20",
    "10PART4",
    "ของที่ได้รับเอกสิทธิตามข้อผูกพันที่ประเทศไทยมีอยู่ต่อองค์การสหประชาชาติหรือตามกฎหมายระหว่างประเทศหรือตามสัญญากับนานาประเทศหรือทางการทูตซึ่งได้ปฏิบัติต่อกันโดยอัธยาศัยไมตรี",
  ],
  [
    "21",
    "11PART4",
    "ของที่นำเข้ามาหรือส่งออกไปเพื่อบริจาคเป็นการสาธารณกุศลแก่ประชาชน โดยผ่านส่วนราชการหรือองค์การสาธารณกุศล หรือเป็นของที่นำเข้ามาเพื่อให้แก่ส่วนราชการหรือองค์การสาธารณกุศลที่เป็นไปตามหลักเกณฑ์และ เงื่อนไขที่อธิบดีกรมศุลกากรกำหนดด้วยความเห็นชอบของรัฐมนตรีว่าการกระทรวงการคลัง ทั้งนี้ไม่รวมถึง.   (ก) รถยนต์และยานยนต์ที่ออกแบบสำหรับขนส่งบุคคลไม่เกิน 9 คน รวมทั้งคนขับ เว้นแต่รถพยาบาล.    (ข) รถยนต์บรรทุกของชนิดแวนและชนิดปิกอัพและรถยนต์ที่มีลักษณะคล้ายกับรถดังกล่าวที่มีน้ำหนักรถรวมน้ำหนักบรรทุก (จี.วี.ดับบลิว) ไม่เกิน 5 ตัน และรถยนต์ดังกล่าวที่มีน้ำหนักรถรวมน้ำหนักบรรทุก (จี.วี.ดับบลิว)  เกิน 5 ตัน ที่มีเครื่องยนต์ที่มิใช่เครื่องยนต์สันดาปภายในแบบลูกสูบที่จุดระเบิด ด้วยการอัด (ดีเซลหรือกึ่งดีเซล) หรือที่จุดระเบิดด้วยประกายไฟ",
  ],
  [
    "22",
    "12PART4",
    "ของที่นำเข้าโดยทางไปรษณีย์ซึ่งแต่ละหีบห่อมีราคาไม่เกินหนึ่งพันบาทหรือของที่นำเข้าทางสนามบินศุลกากรซึ่งแต่ละรายมีราคาไม่เกินหนึ่งพันบาท",
  ],
  ["23", "13PART4", "ยุทธภัณฑ์ที่ใช้ในทางราชการ"],
  [
    "24",
    "14PART4",
    "ตัวอย่างสินค้าทิ่ใช้ได้แต่เพียงเป็นตัวอย่างและไม่มีราคาในทางการค้า",
  ],
  [
    "25",
    "15PART4",
    'ภาชนะบรรจุของชนิดที่ใช้บรรจุของเพื่อความสะดวกหรือความปลอดภัยในการขนส่งระหว่างประเทศที่เรียกว่า"คอนเทนเนอร์"ซึ่งนำเข้าและจะส่งกลับออกไปไม่ว่าจะโดยมีของบรรจุอยู่หรือไม่ทั้งนี้ตามหลักเกณฑ์และเงื่อนไขที่อธิบดีกรมศุลกากรกำหนด',
  ],
  [
    "26",
    "16PART4",
    'ของที่นำเข้ามาสำหรับคนพิการใช้โดยเฉพาะหรือใช้ในการฟื้นฟูสมรรถภาพคนพิการตามหลักเกณฑ์และเงื่อนไขที่อธิบดีกรมศุลกากรกำหนดด้วยความเห็นชอบของรัฐมนตรีว่าการกระทรวงการคลังหมายเหตุคำว่า"คนพิการ"และ"การฟื้นฟูสมรรถภาพคนพิการ"ให้เป็นไปตามกฎหมายว่าด้วยการฟื้นฟูสมรรถภาพคนพิการ',
  ],
  [
    "27",
    "17PART4",
    "ของที่พิสูจน์ให้เป็นที่พอใจของอธิบดีกรมศุลกากรหรือผู้ซึ่งอธิบดีกรมศุลกากรมอบหมายว่าเป็นของที่จำเป็นต้องนำเข้ามาเพื่อใช้ในการประชุมระหว่างประเทศและมีปริมาณพอสมควรแก่การนั้นทั้งนี้ผู้นำของเข้าจะต้องปฏิบัติตามหลักเกณฑ์และเงื่อนไขที่อธิบดีกรมศุลกากรหรือผู้ซึ่งอธิบดีกรมศุลกากรมอบหมายกำหนด",
  ],
  [
    "28",
    "18PART4",
    "ของส่งออกซึ่งพิสูจน์ให้เป็นที่พอใจอธิบดีกรมศุลกากรว่าเป็นของที่ได้นำเข้ามาไม่เกินสองปีและยังมิได้เปลี่ยนแปลงลักษณะหรือรูปแต่ประการใด",
  ],
  [
    "29",
    "19PART4",
    "ภาชนะสำหรับบรรจุของ รวมทั้ง อุปกรณ์ที่ใช้บรรจุ ยึด รัด กันกระแทกไม่ว่าจะทำด้วยวัตถุใด ๆ ก็ตาม ที่นำเข้ามาและจะส่งกลับออกไป ทั้งนี้ ตามหลักเกณฑ์และเงื่อนไขที่อธิบดีกรมศุลกากรกำหนด",
  ],
];

$(document).ready(function () {
  $("#table-ref").DataTable({
    data: dataSet,
    columns: [
      { title: "ลำดับ", className: "txt-center" },
      { title: "ประเภทพิกัด", className: "txt-center" },
      { title: "รายละเอียด" },
    ],
    responsive: true,
    scroller: true,
    scrollY: 650,
    scrollX: true,
  });

  dataTable.FixedHeader(table);
});
